---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Application..::..OpenDocumentFile Method
Application Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | OpenDocumentFile(String) | Opens a document from disk. |
|  | OpenDocumentFile(ModelPath, OpenOptions) | Opens a document from disk or cloud. |
|  | OpenDocumentFile(ModelPath, OpenOptions, IOpenFromCloudCallback) | Opens a document from disk or cloud. |

# See Also

Application Class

Application Members

Autodesk.Revit.ApplicationServices Namespace